Сборка типовых шагов анализа данных, обязательных к выполнению или регулярно использующихся

[0. Переименования колонок, форматирование дат](#0)

[1. Временной интервал данных](#1)

[2. ](#2)

[3. ](#3)

[4. ](#4)

[5. ](#5)

[6. ](#6)

[7. ](#7)

[8. ](#8)

[9. ](#9)


<a id="1"></a>

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
sns.set(font_scale=2, style="whitegrid", rc={'figure.figsize' : (15,7)})
import matplotlib.pyplot as plt
from scipy import special
plt.style.use('dark_background')

In [2]:
url='https://drive.google.com/file/d/1mk45XHSQiPtWl8SpgX8SWYoFIwtZuzi3/view?usp=drive_link'
url='https://drive.google.com/uc?id=' + url.split('/')[-2]
df = pd.read_csv(url)

In [4]:
df

     order_date        order_id           customer  grand_total
0        9/7/11  CA-2011-100006        Dennis Kane          378
1        7/8/11  CA-2011-100090         Ed Braxton          699
2       3/14/11  CA-2011-100293   Neil Franz�sisch           91
3       1/29/11  CA-2011-100328    Jasper Cacioppo            4
4        4/8/11  CA-2011-100363        Jim Mitchum           21
...         ...             ...                ...          ...
5004    11/4/14  US-2014-168802      Jack O'Briant           18
5005    7/24/14  US-2014-169320     Lena Hernandez          171
5006     9/8/14  US-2014-169488       Allen Armold           57
5007    8/29/14  US-2014-169502  Matthew Grinstein          113
5008     7/8/14  US-2014-169551          Rob Lucas         1345

[5009 rows x 4 columns]

<a id="0"></a> Переименования колонок, форматирование дат

In [11]:
df.rename(columns = {'order_date' : 'order_date',
                     'order_date' : 'order_date'})

     order_date        order_id           customer  grand_total
0    2011-09-07  CA-2011-100006        Dennis Kane          378
1    2011-07-08  CA-2011-100090         Ed Braxton          699
2    2011-03-14  CA-2011-100293   Neil Franz�sisch           91
3    2011-01-29  CA-2011-100328    Jasper Cacioppo            4
4    2011-04-08  CA-2011-100363        Jim Mitchum           21
...         ...             ...                ...          ...
5004 2014-11-04  US-2014-168802      Jack O'Briant           18
5005 2014-07-24  US-2014-169320     Lena Hernandez          171
5006 2014-09-08  US-2014-169488       Allen Armold           57
5007 2014-08-29  US-2014-169502  Matthew Grinstein          113
5008 2014-07-08  US-2014-169551          Rob Lucas         1345

[5009 rows x 4 columns]

In [ ]:
df.order_date = pd.to_datetime(df.order_date)

In [9]:
df.dtypes

order_date     datetime64[ns]
order_id               object
customer               object
grand_total             int64
dtype: object

<a id="1"></a> Временной интервал данных

In [3]:
pd.DataFrame({'':['start date', 'end_date'],' ': [df['order_date'].min(),df['order_date'].max()]})

0  start date  1/1/14
1    end_date  9/9/14